app/controllers/api/v1/artists_controller.rb

SELECT "artists".* FROM "artists"
---
      def index
        render json: Artist.all