app/controllers/api/v1/playlists_controller.rb

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT 1  [["id", 1]]
---
     def show
       render json: Playlist.find(params[:id])

INSERT INTO "playlists" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "new playlist"], ["created_at", "2015-04-27 20:06:32.935502"], ["updated_at", "2015-04-27 20:06:32.935502"]]
---
      def create
        @playlist = Playlist.new(playlist_params)
        if @playlist.save

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "playlists" SET "user_id" = ?, "updated_at" = ? WHERE "playlists"."id" = ?  [["user_id", 1], ["updated_at", "2015-04-27 20:11:05.975200"], ["id", 11]]
---
      def update
        @playlist = Playlist.find(params[:id])

        if @playlist.update(playlist_params)