app/controllers/api/v1/playlist_songs_controller.rb

  def index
    @playlist_songs = PlaylistSong.all
---
SELECT "playlist_songs".* FROM "playlist_songs" WHERE "playlist_songs"."playlist_id" = ?  [["playlist_id", 1]]

    def set_playlist_song
      @playlist_song = PlaylistSong.find(params[:id])
---
SELECT  "playlist_songs".* FROM "playlist_songs" WHERE "playlist_songs"."id" = ? LIMIT 1  [["id", 1]]