app/controllers/api/v1/songs_controller.rb

SELECT "songs".* FROM "songs"
---
     def index
        @song = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 5]]
---
     def show
        render json: Song.find(params[:id])

INSERT INTO "songs" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-04-21 21:17:34.412391"], ["updated_at", "2015-04-21 21:17:34.412391"]]
---
      def create
        @song = Song.new(params[:song])
        if @song.save