app/controllers/api/v1/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "encrypted_password", "auth_token") VALUES (?, ?, ?, ?)